'use strict'

//    Умовні розгалуження
// 1. Напишіть програму, яка перевіряє, чи число є додатним, від'ємним чи нулем. Виведіть відповідне повідомлення для кожного випадку.

// let num = prompt('Введіть число:');
// if(num > 0){
//     alert('Число додатнє');
// }else if(num < 0){
//     alert(`Число від'ємне`);
// }else{
//     alert('Число дорівнює нулю');
// }
//варіант з тернарним оператором
// let num = prompt('Введіть число:');
// let result = (num > 0) ? alert('Число додатнє'):
//     (num < 0) ? alert(`Число від'ємнє`):
//     alert('Число дорівнює нулю');

//2. Напишіть програму, яка перевіряє, чи число є парним. Виведіть повідомлення "Парне" або "Непарне" в залежності від результату.
// let inputNum = prompt('Введіть число');
// if(inputNum % 2 == 0){
//     alert('Число є парним')
// }else alert('Число не парне');
//варіант з тернарним оператором
// let inputNum = prompt('Введіть число:');
// let ternarVariant = (inputNum % 2 == 0) ? alert('Число парне') : alert('Число не парне');

//3. Напишіть програму, яка порівнює два числа і виводить повідомлення про те, яке з них більше або чи вони рівні.
// let num1 = prompt('Введіть перше число:');
// let num2 = prompt('Введіть друге число:');
// if(num1 > num2){
//     alert(`${num1} є більше ніж ${num2}`)
// }else if (num1 === num2){
//     alert(`${num1} дорівнює ${num2}`)
// }else alert(`${num1} менше ніж ${num2}`);

//варіант з тернарним оператором
// let num1 = prompt('Введіть перше число:');
// let num2 = prompt('Введіть друге число:');
// let result = (num1 > num2) ? alert(`${num1} є більше ніж ${num2}`) :
//     (num1 === num2) ? alert(`${num1} дорівнює ${num2}`):
//     alert(`${num1} є менше ніж ${num2}`);

//4. Напишіть програму, яка перевіряє, чи є введене число кратним 5. Виведіть повідомлення "Кратне 5" або "Не кратне 5" в залежності від результату.
// let num = prompt('Введіть число:');
// if(num % 5 === 0){
//     alert(`Число ${num} кратне 5`)
// }else alert(`Число ${num} не кратне 5`);

//варіант з тернарним оператором
// let num = prompt('Введіть число:');
// let result = (num % 5 ===0) ? alert(`Число ${num} є кратне 5`) : alert(`Число ${num} не кратне 5`);

//5. Напишіть програму, яка перевіряє, чи введене число є дільником 10. Виведіть повідомлення "Дільник 10" або "Не дільник 10" в залежності від результату.
// let num = prompt('Введіть число:');
// if(10 % num === 0 && num <= 10){
//     alert(`Число ${num} є дільником 10`)
// }else alert(`Число ${num} не є дільником 10`);

//варіант з тернарним оператором
// let num = prompt('Введіть число:');
// let result = (10 % num === 0 && num <= 10) ? alert(`Число ${num} є дільником 10`) : alert(`Число ${num} не є дільником 10`);    

//6. Напишіть програму, яка перевіряє, чи є введене число додатним та парним одночасно. Виведіть відповідне повідомлення.
// let num = prompt('Введіть число:');
// if(num > 0 && num % 2 === 0){
//     alert(`Число ${num} є додатним та парним одночасно`);
// }else alert(`Число ${num} не є додатним та парним одночасно`);

//варінат з тернарним оператором
// let num = prompt('Введіть число:');
// let result = (num > 0 && num % 2 ===0) ? alert(`Число ${num} є додатним та парним одночасно`) : alert(`Число ${num} не є додатним та парним одночасно`);

//7. Напишіть програму, яка перевіряє, чи введене число є кратним 3 і 5 одночасно. Виведіть відповідне повідомлення.
// let num = prompt('Введіть число:');
// if(num % 3 === 0 && num % 5 === 0 && num >= 0){
//     alert(`Число ${num} є кратним 3 і 5 одночасно`)
// }else alert(`Число ${num} не є кратним 3 і 5 одночасно`);

//варіант з тернарним оператором
// let num = prompt('Введіть число:');
// let result = (num % 3 === 0 && num % 5 === 0 && num >= 0) ? alert(`Число ${num} є кратним 3 і 5 одночасно`) : alert(`Число ${num} не є кратним 3 і 5 одночасно`);

//8.* Розробіть програму, яка перевіряє, чи є рік, введений користувачем, високосним. Виведіть повідомлення "Рік є високосним" або "Рік не є високосним".
// let year = prompt('Введіть рік:');
// if(year % 4 === 0 || year || 100 && year || 400){
//     alert(`Рік ${year} є високосним`)
// }else alert(`Рік ${year} не є високосним`);

//варіант з тернарним оператором
// let year = prompt('Введіть рік:');
// let result = (year % 4 === 0 || year % 100 === 0 || year % 400 === 0) ? alert(`Рік ${year} є високосним`) : alert(`Рік ${year} не є високосним`);

//Задачі зі статті 
//2. Використовуючи конструкцію if..else, напишіть код, що запитує: ‘Яка “офіційна” назва JavaScript?’
// Якщо відвідувач вводить “ECMAScript”, виведіть “Правильно!”, в іншому випадку — виведіть: “Ви не знаєте? ECMAScript!”
// let whichYear = prompt('Яка офіційна назва javaScript?');
// if(whichYear === 'ECMAScript'){
//     alert('Правильно!')
// }else alert('Ви не знаєте? ECMAScript!');

//варіант з тернарним оператором
// let whichYear = prompt('Яка офіційна назва javaScript?');
// let result = (whichYear === 'ECMAScript') ? alert('Правильно!') : alert('Ви не знаєте? ECMAScript!');

//3.Використовуючи if..else, напишіть код, що отримує число за допомогою prompt і потім виводить повідомлення alert:
// 1, якщо значення більше нуля,
// -1, якщо меньше нуля,
// 0, якщо дорівнює нулю.
// let num = +prompt('Введіть число:');
// if(num > 0){
//     alert('1');
// }else if(num < 0){
//     alert('-1');
// }else alert('0')

//варіант з тернарним оператором

let num = +prompt('Введіть число:');
let result = (num > 0) ? alert('1') :
(num < 0) ? alert('-1') :
alert('0');


